app/controllers/memory_controller.rb

  def recall
    payload = params.to_unsafe_h

    project_key       = payload['project_key']
    task_external_id  = payload['task_external_id']
    repo_path         = payload['repo_path']
    symbols           = payload['symbols'] || []
    signals           = payload['signals'] || []
    limit_tokens      = (payload['limit_tokens'] || 2000).to_i

    unless project_key.present?
      return render json: { status: 'error', message: 'project_key is required' }, status: :unprocessable_entity
    end

    project = Project.find_by(key: project_key)
---
SELECT "projects".* FROM "projects" WHERE "projects"."key" = 'demo' LIMIT 1


    # Поиск воспоминаний
    # task_external_id передается отдельно для фильтрации
    records = MemoryRecord.search(
      query: search_query,
      project: project,
      task_external_id: task_external_id,
      repo_path: repo_path,
      symbols: symbols,
      signals: signals,
      limit: 50 # Больше чем нужно, потом отфильтруем по токенам
    )
---
SELECT "memory_records".* FROM "memory_records" WHERE (ttl IS NULL OR ttl > '2025-11-04 07:06:04.253885') AND "memory_records"."project_id" = 1 AND "memory_records"."task_external_id" = 'CS-214' AND (content ILIKE '%CS-214 CartSessions::Setting#trigger_delay_time_in_minutes nil-delay unit-mismatch%') AND (scope && 'app', 'services', 'cart_sessions') AND (tags && 'nil-delay', 'unit-mismatch') LIMIT 50

    scope             = payload['scope'] || []
    tags              = payload['tags'] || []
    owner             = payload['owner']
    ttl               = payload['ttl']
    quality           = payload['quality'] || {}
    meta              = payload['meta'] || {}

    unless project_key.present? && kind.present? && content.present?
      return render json: { status: 'error', message: 'project_key, kind, content are required' }, status: :unprocessable_entity
    end

    project = Project.find_or_initialize_by(key: project_key)
---
SELECT "projects".* FROM "projects" WHERE "projects"."key" = 'demo' LIMIT 1